app/Controllers/Products.php

    public function index() {
        $data['page_title'] = 'Viewing Products List';
        $data['title'] = 'Viewing Products List';
        $product_model = new \App\Models\Products_Model();
        $data['products'] = $product_model->findAll();
---
SELECT *
FROM `products`

    public function edit($ProductID)
    {
        $data['title'] = 'Edit User';
        $data['page_title'] = 'Editing User';
        helper('form');
        $product_model = new \App\Models\Products_model();
        $data['product'] = $product_model->find($ProductID);
---
SELECT *
FROM `products`
WHERE `products`.`ProductID` = '5'